/* SKTUnknownFileReadError */

/* In Sketch this particular localized description won't be presented to the user, but it's always a good idea to provide a decent description that's a full sentence, just in case the error gets reused in a new way. */
"description1" = "SketchyDraw document data could not be read because it is corrupted.";

/* In Sketch this localized failure reason will be presented to the user if we're trying to open a document. When -[SKTDocument readFromData:ofType:error:] returns an error NSDocumentController will take the failure reason and tack it onto the end of a "The document "so-and-so" could not be opened." message and use the whole thing as an error description. Full sentence! */
"failureReason1" = "It appears to be corrupted.";

/* SKTUnknownPasteboardReadError */

/* In Sketch this localized description will be presented to the user by -[SKTGraphicView paste:]. */
"description2" = "SketchyDraw pasteboard data could not be read for an unknown reason.";

/* In Sketch this particular localized failure reason won't be presented to the user, but it's always a good idea to provide a decent failure reason that's a full sentence, just in case the error gets reused in a new way. */
"failureReason2" = "An unknown error occured.";

/* SKTWriteCouldntMakeTIFFError */

/* In Sketch this particular localized description won't be presented to the user, but it's always a good idea to provide a decent description that's a full sentence, just in case the error gets reused in a new way. */
"description3" = "A TIFF image could not be made because it would be empty.";

/* In Sketch this localized failure reason will be presented to the user. When -[SKTDocument dataOfType:error:] returns an error NSDocument will take the error reason and tack it onto the end of a "The document "so-and-so" could not be saved." message and use the whole thing as an error description. Full sentence! */
"failureReason3" = "The TIFF image would be empty.";
"A TIFF image could not be made because it would be empty."	=	"A TIFF image could not be made because it would be empty.";
"The TIFF image would be empty."	=	"The TIFF image would be empty.";
"Sketch document data could not be read for an unknown reason."	=	"Sketch document data could not be read for an unknown reason.";
"An unknown error occured."	=	"An unknown error occured.";
"File format is not well-formed."	=	"File format is not well-formed.";
"A TIFF image could not be made for an unknown reason."	=	"A TIFF image could not be made for an unknown reason.";
"suggestion1"	=	"SketchyDraw document data could not be read because it is corrupted.";
"suggestion2"	=	"SketchyDraw pasteboard data could not be read for an unknown reason.";
"suggestion3"	=	"You need to create some objects.";
"description4"	=	"Image size is zero size.";
"failureReason4"	=	"Image size is zero size.";
"suggestion4"	=	"It appears to be corrupted.";
"description5"	=	"Could not allocate image.";
"failureReason5"	=	"Could not allocate image.";
"suggestion5"	=	"File format is not well-formed.";
"description6"	=	"String was not recognized that identifies the type of data.";
"failureReason6"	=	"String was not recognized that identifies the type of data.";
"suggestion6"	=	"Read unsupported scheme.";
"description7"	=	"Unsupported Illustrator format.";
"failureReason7"	=	"Unsupported Illustrator format.";
"suggestion7"	=	"This file is not compatible with PDF and EPS.";
"\'%@\' type is not supported."	=	"\'%@\' type is not supported.";
"'%@' image is not created."	=	"'%@' image is not created.";
"%u objects are not written out, was."	=	"%lu objects are not written out, was.";
